Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::Equipment Class Referencefinal
MEP Element Manager
The Equipment is a complex element with more than two ports. More...
#include <MEPEquipment.hpp>
 Inheritance diagram for ACAPI::MEP::v1::Equipment:
 Public Member Functions
EquipmentDefault  | PickUpDefault () const
Picks up the Default from the Equipment.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | Inject (const EquipmentDefault &equipmentDefault)
Injects the Default settings into the Equipment.
 Public Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::v1::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< Equipment >  | Get (const UniqueID &uniqueId)
Returns an Equipment.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::v1::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The Equipment is a complex element with more than two ports.
Since
Archicad 27
Member Function Documentation
◆ Get()
 static Result< Equipment > ACAPI::MEP::v1::Equipment::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns an Equipment.
Parameters
uniqueId | The UniqueID of the requested Equipment.
Returns
If the uniqueId belongs to an Equipment, returns the object associated to it, otherwise Error.
◆ Inject()
 Result< void > ACAPI::MEP::v1::Equipment::Inject  |  ( |  const EquipmentDefault &  |  equipmentDefault | )
Injects the Default settings into the Equipment.
Parameters
equipmentDefault | The Default what will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::Equipment::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 EquipmentDefault ACAPI::MEP::v1::Equipment::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the Equipment.
Returns
Returns an EquipmentDefault with the parameters of the object it was called for.